{"class_name": "Model", "config": {"name": "model_8", "layers": [{"name": "input_10", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 3], "name": "input_10", "dtype": "float32", "sparse": false}, "inbound_nodes": []}, {"name": "dense_28", "class_name": "Dense", "config": {"bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "units": 32, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_28", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activation": "relu", "kernel_constraint": null, "use_bias": true}, "inbound_nodes": [[["input_10", 0, 0, {}]]]}, {"name": "dense_29", "class_name": "Dense", "config": {"bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "units": 12, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_29", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activation": "relu", "kernel_constraint": null, "use_bias": true}, "inbound_nodes": [[["dense_28", 0, 0, {}]]]}, {"name": "dense_30", "class_name": "Dense", "config": {"bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "units": 1, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_30", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activation": "linear", "kernel_constraint": null, "use_bias": true}, "inbound_nodes": [[["dense_29", 0, 0, {}]]]}], "output_layers": [["dense_30", 0, 0]], "input_layers": [["input_10", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.1.5"}